zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/silabs/emlib/inc/em_eusart.h
/***************************************************************************//**
 * @file
 * @brief Universal asynchronous receiver/transmitter (EUSART) peripheral API
 *******************************************************************************
 * # License
 * <b>Copyright 2019 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifndef EM_EUSART_H
#define EM_EUSART_H
#include "em_device.h"
#if defined(EUART_PRESENT) || defined(EUSART_PRESENT)
#include "em_eusart_compat.h"
#include <stdbool.h>

/* *INDENT-OFF* */
// *****************************************************************************
/// @addtogroup eusart EUSART - Extended USART
/// @brief Extended Universal Synchronous/Asynchronous Receiver/Transmitter
///
/// @li @ref eusart_intro
/// @li @ref eusart_example
/// @li @ref eusart_em2
///
///@n @section eusart_intro Introduction
///  This module contains functions to control the Enhanced Universal Synchronous
///  / Asynchronous Receiver / Transmitter controller(s) (EUSART) peripheral of Silicon
///  Labs' 32-bit MCUs and SoCs. The EUSART can be used as a UART and can,
///  therefore, be connected to an external transceiver to communicate with
///  another host using the serial link.
///
///  It supports full duplex asynchronous UART communication as well as RS-485,
///  SPI, MicroWire, and 3-wire. It can also interface with ISO7816 Smart-Cards,
///  and IrDA devices.
///
///  The EUSART has a wide selection of operating modes, frame formats, and baud rates.
///  All features are supported through the API of this module.
///
/// This module does not support DMA configuration. The UARTDRV and SPIDRV drivers
/// provide full support for DMA and more.
///
///@n @section eusart_example Example
///
///  EUSART Async Tx example:
///  @code{.c}
///  {
///    EUSART_UartInit_TypeDef init = EUSART_UART_INIT_DEFAULT_HF;
///
///    // Configure the clocks.
///    CMU_ClockSelectSet(cmuClock_EUSART0CLK, cmuSelect_EM01GRPCCLK);
///    CMU_ClockEnable(cmuClock_EUSART0CLK, true);
///    // Initialize the EUSART
///    EUSART_UartInitHf(EUSART0, &init);
///    EUSART_Tx(EUSART0, data);
///  }
///
///  @endcode
///
///  EUSART Sync SPI Transaction example:
///  @code{.c}
///  {
///    EUSART_SpiInit_TypeDef init_master = EUSART_SPI_MASTER_INIT_DEFAULT_HF;
///
///    // Configure the clocks.
///    CMU_ClockSelectSet(cmuClock_EM01GRPCCLK, cmuSelect_HFRCODPLL);
///    CMU_ClockEnable(cmuClock_EUSART1, true);
///    CMU_ClockEnable(cmuClock_GPIO, true);
///
///    //Configure the SPI ports
///    GPIO_PinModeSet(sclk_port, sclk_pin, gpioModePushPull, 0);
///    GPIO_PinModeSet(mosi_port, mosi_pin, gpioModePushPull, 0);
///    GPIO_PinModeSet(mosi_port, miso_pin, gpioModeInput, 0);
///
///    // Connect EUSART to ports
///    GPIO->EUSARTROUTE[EUSART_NUM(EUSART1)].TXROUTE = (mosi_port << _GPIO_EUSART_TXROUTE_PORT_SHIFT)
///                                                     | (mosi_pin << _GPIO_EUSART_TXROUTE_PIN_SHIFT);
///    GPIO->EUSARTROUTE[EUSART_NUM(EUSART1)].RXROUTE = (miso_port << _GPIO_EUSART_RXROUTE_PORT_SHIFT)
///                                                     | (miso_pin << _GPIO_EUSART_RXROUTE_PIN_SHIFT);
///    GPIO->EUSARTROUTE[EUSART_NUM(EUSART1)].SCLKROUTE = (sclk_port << _GPIO_EUSART_SCLKROUTE_PORT_SHIFT)
///                                                     | (sclk_pin << _GPIO_EUSART_SCLKROUTE_PIN_SHIFT);
///    GPIO->EUSARTROUTE[EUSART_NUM(EUSART1)].ROUTEEN = GPIO_EUSART_ROUTEEN_TXPEN | GPIO_EUSART_ROUTEEN_SCLKPEN;
///
///    // Initialize the EUSART
///    EUSART_SpiInit(EUSART1, &init_master);
///    EUSART_Spi_TxRx(EUSART1, data);
///  }
///
///  @endcode
///@n @section eusart_em2 EM2 guidelines for non EM2-Capable instances
///
/// @note  EUSART instances located in the PD1 power domain are non EM2-capable.
///  The @ref <b>EUSART_EM2_CAPABLE()</b> and @ref <b>EUSART_NOT_EM2_CAPABLE()</b> macros can be used
///  to determine whether or not a EUSART instance is EM2-Capable.
///
///  Follow theses steps when entering in EM2:
///  -# Wait for the current transaction to complete with TXCIF interrupt
///  -# Disable TX and RX using TXDIS and RXDIS cmd
///  -# Poll for EUSARTn_SYNCBUSY.TXDIS and EUSARTn_SYNCBUSY.RXDIS to go low
///  -# Wait for EUSARTn_STATUS.TXENS and EUSARTn_STATUS.RXENS to go low
///  -# Disable SCLKPEN and CSPEN in GPIO if they were previously enabled
///  -# Enter EM2
///
///  On wakeup from EM2, EUSART transmitter/receiver and relevant GPIO
///  (SCLKPEN and CSPEN) must be re-enabled. For example:
///
///  @code{.c}
///  {
///    // Enable Tx and Rx
///    EUSART_Enable(EUSART0, eusartEnable);
///    BUS_RegMaskedWrite(&GPIO->EUSARTROUTE[EUSART_NUM(EUSART0)].ROUTEEN,
///                       _GPIO_EUSART_ROUTEEN_TXPEN_MASK | _GPIO_EUSART_ROUTEEN_SCLKPEN_MASK,
///                       GPIO_EUSART_ROUTEEN_TXPEN | GPIO_EUSART_ROUTEEN_SCLKPEN);
///  }
///  @endcode
///
/// @{
// *****************************************************************************
/* *INDENT-ON* */

