zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/silabs/emlib/inc/em_eusart.h
#if defined(EUSART_DALICFG_DALIEN)
/// Default configuration for EUSART initialization structure in DALI mode with high-frequency clock.
/// Default configuration for EUSART advanced initialization structure.
#define EUSART_ADVANCED_DALI_INIT_DEFAULT                                                   \
  {                                                                                         \
    eusartHwFlowControlNone,        /* Flow control disabled. */                            \
    false,                          /* Collision dectection disabled. */                    \
    true,                           /* Data is sent with the most significant bit first. */ \
    eusartInvertIODisable,          /* Rx and Tx signal active high. */                     \
    false,                          /* No DMA wake up on reception. */                      \
    false,                          /* No DMA wake up on transmission. */                   \
    false,                          /* Halt DMA on error disabled. */                       \
    EUSART_DEFAULT_START_FRAME,     /* No start frame.  */                                  \
    false,                          /* Tx auto tristate disabled. */                        \
    false,                          /* Do not use PRS signal as Rx signal.*/                \
    (EUSART_PrsChannel_TypeDef) 0u, /* EUSART Rx connected to prs channel 0. */             \
    false,                          /* Multiprocessor mode disabled. */                     \
    false,                          /* Multiprocessor address bit : 0.*/                    \
  }

/// Default configuration for EUSART initialization structure in DALI mode with high-frequency clock.
#define EUSART_UART_DALI_INIT_DEFAULT_HF                                                              \
  {                                                                                                   \
    eusartEnable,              /* Enable RX/TX when initialization completed. */                      \
    0,                         /* Use current configured reference clock for configuring baud rate.*/ \
    1200,                      /* 1200 bits/s. */                                                     \
    eusartOVS16,               /* Oversampling x16. */                                                \
    eusartDataBits8,           /* 8 data bits. */                                                     \
    eusartNoParity,            /* No parity. */                                                       \
    eusartStopbits1,           /* 1 stop bit. */                                                      \
    eusartMajorityVoteEnable,  /* Majority vote enabled. */                                           \
    eusartLoopbackDisable,     /* Loop back disabled. */                                              \
    NULL,                      /* Default advanced settings. */                                       \
  }

/// Default configuration for EUSART initialization structure in DALI mode with low-frequency clock.
#define EUSART_UART_DALI_INIT_DEFAULT_LF                                                               \
  {                                                                                                    \
    eusartEnable,               /* Enable RX/TX when initialization completed. */                      \
    0,                          /* Use current configured reference clock for configuring baud rate.*/ \
    1200,                       /* 1200 bits/s. */                                                     \
    eusartOVS0,                 /* Oversampling disabled. */                                           \
    eusartDataBits8,            /* 8 data bits. */                                                     \
    eusartNoParity,             /* No parity. */                                                       \
    eusartStopbits1,            /* 1 stop bit. */                                                      \
    eusartMajorityVoteDisable,  /* Majority vote enabled. */                                           \
    eusartLoopbackDisable,      /* Loop back disabled. */                                              \
    NULL,                       /* Default advanced settings. */                                       \
  }

/// Default configuration for EUSART initialization structure in DALI mode with high-frequency clock.
#define EUSART_DALI_INIT_DEFAULT_HF                                    \
  {                                                                    \
    EUSART_UART_DALI_INIT_DEFAULT_HF,                                  \
    false,                      /* Disable DALI low frequency mode. */ \
    eusartDaliTxDataBits16,     /* TX 16 data bits. */                 \
    eusartDaliRxDataBits8,      /* RX 8 data bits. */                  \
  }                                                                    \

/// Default configuration for EUSART initialization structure in DALI mode with low-frequency clock.
#define EUSART_DALI_INIT_DEFAULT_LF                                   \
  {                                                                   \
    EUSART_UART_DALI_INIT_DEFAULT_LF,                                 \
    true,                       /* Enable DALI low frequency mode. */ \
    eusartDaliTxDataBits16,     /* TX 16 data bits. */                \
    eusartDaliRxDataBits8,      /* RX 8 data bits. */                 \
  }                                                                   \

#endif /* EUSART_DALICFG_DALIEN */
#endif /* EUSART_PRESENT */

/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

/***************************************************************************//**
 * Initializes the EUSART when used in UART mode with the high frequency clock.
 *
 * @param eusart Pointer to the EUSART peripheral register block.
 * @param init A pointer to the initialization structure.
 ******************************************************************************/
void EUSART_UartInitHf(EUSART_TypeDef *eusart, const EUSART_UartInit_TypeDef *init);

/***************************************************************************//**
 * Initializes the EUSART when used in UART mode with the low frequency clock.
 *
 * @param eusart Pointer to the EUSART peripheral register block.
 * @param init A pointer to the initialization structure.
 ******************************************************************************/
void EUSART_UartInitLf(EUSART_TypeDef *eusart, const EUSART_UartInit_TypeDef *init);

/***************************************************************************//**
 * Initializes the EUSART when used in IrDA mode with the high or low
 * frequency clock.
 *
 * @param eusart Pointer to the EUSART peripheral register block.
 * @param irdaInit A pointer to the initialization structure.
 ******************************************************************************/
void EUSART_IrDAInit(EUSART_TypeDef *eusart,
                     const EUSART_IrDAInit_TypeDef *irdaInit);

#if defined(EUSART_PRESENT)
/***************************************************************************//**
 * Initializes the EUSART when used in SPI mode.
 *
 * @param eusart Pointer to the EUSART peripheral register block.
 * @param init A pointer to the initialization structure.
 ******************************************************************************/
void EUSART_SpiInit(EUSART_TypeDef *eusart, const EUSART_SpiInit_TypeDef *init);

